app/controllers/pix_transactions_controller.rb

SELECT "pix_transactions".* FROM "pix_transactions" WHERE "pix_transactions"."status" = ? ORDER BY "pix_transactions"."created_at" DESC  [["status", "pending"]]
SELECT "pix_transactions".* FROM "pix_transactions" ORDER BY "pix_transactions"."created_at" DESC
---
  def index
    status = params[:status]
    if status.present?
      @pix_transactions = PixTransaction.where(status: status).order(created_at: :desc)
    else
      @pix_transactions = PixTransaction.order(created_at: :desc)

INSERT INTO "pix_transactions" ("pix_key", "amount", "scheduled_at", "status", "created_at", "updated_at", "pix_key_type") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "pix_transactions".* FROM "pix_transactions"
---
  def create
    Rails.logger.info "Parametros recebidos: #{params.inspect}"
    @pix_transaction = PixTransaction.new(pix_transaction_params)
    @pix_transaction.status = 'pending'

    if @pix_transaction.save
      if @pix_transaction.scheduled_at.present? && @pix_transaction.scheduled_at > Time.current

SELECT "pix_transactions".* FROM "pix_transactions" WHERE "pix_transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pix_transactions" WHERE "pix_transactions"."id" = ?  [["id", 1]]
---
  def destroy
    @pix_transaction = PixTransaction.find(params[:id])
    @pix_transaction.destroy

UPDATE "pix_transactions" SET "status" = ?, "updated_at" = ? WHERE "pix_transactions"."id" = ?  [["status", "completed"], ["updated_at", "2024-06-14 18:40:04.618072"], ["id", 30]]
---
  def process_pix(transaction)
    if transaction.scheduled_at.present? && transaction.scheduled_at > Time.current
      transaction.update(status: 'pending')