app/jobs/pix_transaction_job.rb

SELECT "pix_transactions".* FROM "pix_transactions" WHERE "pix_transactions"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
---
    def perform(pix_transaction_id)
      pix_transaction = PixTransaction.find(pix_transaction_id)

UPDATE "pix_transactions" SET "status" = ?, "updated_at" = ? WHERE "pix_transactions"."id" = ?  [["status", "completed"], ["updated_at", "2024-07-11 22:38:47.036740"], ["id", 45]]
---
    def process_pix(transaction)
      transaction.update(status: 'completed')