app/jobs/scheduled_transaction_checker_job.rb

SELECT "pix_transactions".* FROM "pix_transactions" WHERE "pix_transactions"."status" = ? AND (scheduled_at <= '2024-07-11 22:40:39.772412') ORDER BY "pix_transactions"."id" ASC LIMIT ?  [["status", "pending"], ["LIMIT", 1000]]
---
    def perform
      PixTransaction.where(status: 'pending').where('scheduled_at <= ?', Time.current).find_each do |transaction|